app/views/users/_form.html.haml

SELECT "roles".* FROM "roles"
---
  = f.text_field :birth_date, :class => 'dob'
  = f.collection_check_boxes :role_ids, Role.all, :id, :name, label: "Choose User Roles"

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "7"]]
---

    $('form.user')
        .bootstrapValidator()
          .on('success.form.bv', function(e) {
              // Called when the form is valid
              var $form = $(e.target);
              if ($form.data('remote')) {
                  e.preventDefault();
                  return false;
              }

          })
          .on('submit', function(e) {
              var $form = $(e.target);
              if ($form.data('remote')) {
                  var numInvalidFields = $form.data('bootstrapValidator').getInvalidFields().length;
                  if (numInvalidFields) {
                      e.preventDefault();
                      return false;
                  }
              }
          });