app/views/users/_user.html.haml

SELECT "roles".* FROM "roles" INNER JOIN "user_roles" ON "roles"."id" = "user_roles"."role_id" WHERE "user_roles"."user_id" = ?  [["user_id", 1]]
---
        %td
          - @user.roles.each do |r|