app/views/users/index.html.haml

SELECT "users".* FROM "users"
---

  (function($) {

    $.fn.modal_success = function(){
      // close modal
      this.modal('hide');

      // clear form input elements
      // todo/note: handle textarea, select, etc
      this.find('form input:text').val('');
      this.find('form input:checkbox').iCheck('uncheck');

      // clear error state
      this.clear_previous_errors();

      toastr.options = {
        "positionClass": "toast-bottom-right"
      }
      Command: toastr.success('User was successfully created!');
      // clear error success
      this.clear_previous_success();
