app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("birth_date", "created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "last_name" = ?, "updated_at" = ? WHERE "users"."id" = 19  [["last_name", "DEV D ff"], ["updated_at", Fri, 14 Nov 2014 21:52:02 UTC +00:00]]